app/controllers/measurements_controller.rb

SELECT `measurements`.* FROM `measurements`
---
  def index
    @measurements = Measurement.all

INSERT INTO `measurements` (`temperature`, `humidity`, `lightLevel`, `device_id`, `created_at`, `updated_at`) VALUES (23.3, 74.0, 97, 2, '2017-07-24 23:26:12', '2017-07-24 23:26:12')
---
  def new
    if measurement_params_no_require.any?
      @measurement = Measurement.new(measurement_params_no_require)

      respond_to do |format|
        if @measurement.save

INSERT INTO `measurements` (`temperature`, `humidity`, `lightLevel`, `device_id`, `created_at`, `updated_at`) VALUES (25.0, 3.0, 0, 2, '2017-07-24 20:58:52', '2017-07-24 20:58:52')
---
  def create
    @measurement = Measurement.new(measurement_params)

    respond_to do |format|
      if @measurement.save

SELECT temperature, humidity, Lightlevel, created_at FROM `measurements`
---
  def showMeasurements
    dataFromMeasurements = Measurement.select("temperature, humidity, Lightlevel, created_at")

DELETE FROM `measurements` WHERE `measurements`.`id` = 5
---
  def destroy
    @measurement.destroy

SELECT  `measurements`.* FROM `measurements` WHERE `measurements`.`id` = 5 LIMIT 1
---
  def set_measurement
    @measurement = Measurement.find(params[:id])